Revit 2026 API

# SchemaCommonVersionGUID Property

---

The property labeled "VersionGUID" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string VersionGUID { get; }
```
```vb
Public Shared ReadOnly Property VersionGUID As String
	Get
```
```cpp
public:
static property String^ VersionGUID {
	String^ get ();
}
```
```fsharp
static member VersionGUID : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString" and will contain a uuid.

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace